#Напишите программу с использованием ООП, которая из файла base.txt, создаёт
#другой файл, в котором будут записаны емейлы имеющие доменное имя
#переданное в качестве аргумента argparse. Название выходного файла должно
#быть email_com.txt если аргумент .com и т.п. По окончании записи, вывести в
#консоль Done!

import argparse

parser = argparse.ArgumentParser()

parser.add_argument('f', help='Имя файла')
args = parser.parse_args()

class Domains:
    def __init__(self):
        self.result = []
        self.content = self.read_file()
        self.search()
        self.write_file()

    def read_file(self, file='base.txt'):
        with open(file, 'r') as source:
            content = source.readlines()
            return content

    def search(self):
        for num, line in enumerate(self.content):
            if line.split(':')[0].endswith(args.f):
                self.result.append(self.content[num])

    def write_file(self, file_name=str('email_' + args.f + '.txt')):
        with open(file_name, 'w') as file:
            file.write(''.join(self.result))
            print('Done!')


dom = Domains()