#Напишите программу с использованием ООП с модулем Click, которая из файла base.txt, создаёт
#другой файл, в котором будут записаны емейлы имеющие доменное имя
#переданное в качестве аргумента argparse. Название выходного файла должно
#быть email_com.txt если аргумент .com и т.п. По окончании записи, вывести в
#консоль Done!

import click

@click.command()
@click.argument('domain')
class Domains:
    def __init__(self, domain=''):
        self.domain = domain
        self.result = []
        self.content = self.read_file()
        self.search()
        file_name = str('email_' + self.domain + '.txt')
        self.write_file(file_name)

    def read_file(self, file='base.txt'):
        with open(file, 'r') as source:
            content = source.readlines()
            return content

    def search(self):
        for num, line in enumerate(self.content):
            if line.split(':')[0].endswith(self.domain):
                self.result.append(self.content[num])

    def write_file(self, file_name):
        with open(file_name, 'w') as file:
            file.write(''.join(self.result))
            print('Done!')


dom = Domains()