#Напишите программу с использованием ООП, которая из файла phonebook_al.txt
#выведет в консоль все строки, которые будут содержать значение переданное в
#качестве параметра, например имя. Используйте любой модуль на своё
#усмотрение.
#При выводе все фамилии должны быть преобразованы в нижний регистр с первой
#заглавной буквой. Если в строке есть емейл, то он не должен отображаться в
#выводе.
#Первая строка в выводе должна быть с количеством найденных записей.
#Найдено 8 записей.

import argparse

parser = argparse.ArgumentParser()

parser.add_argument('s', help='Параметр поиска')
args = parser.parse_args()
print(args)


class Phonebook:

    def __init__(self):
        self.res = []
        self.content = self.read_file()
        self.search()
        self.output()

    def read_file(self, file_name='phonebook_al.txt'):
        with open(file_name, 'r', encoding='utf-8') as file_source:
            return file_source.readlines()

    def search(self, content=args.s):
        for line in self.content:
            if '@' in line.split('   ')[-1]:
                line = ''.join(line.split('   ')[:-1])
                if args.s.lower() in line.lower():
                    self.res.append(line.title())
        return self.res

    def output(self):
        print(f'Найдено {len(self.res)} записей.\n\n', '\n'.join(self.res))


search = Phonebook()