"""Напишите программу с использованием ООП и модулей argparse, itertools,
random, time. Программа должна записывать в файл все возможные комбинации
чисел от нуля до 9. Длина комбинации чисел задаётся аргументом в командной
строке. Записи в файле должны быть в рандомном порядке. Например при
указанном аргументе 4 содержимое файла будет выглядеть так:
2346
0050
8542
6521
...
При запуске программы считается количество комбинаций и выводится (до записи
в файл):
Start process...
Количество комбинаций: 10000После записи в файл вывести в консоль время за которое записался файл с
ограничением 2 знака после точки.
Completed in: 0.18 sec.
Название выходного файла num_dict4 если комбинация из 4-х цифр, num_dict5
если из пяти. То есть добавлять цифру, взависимости от длины комбинации."""

import argparse, itertools, random, time

parser = argparse.ArgumentParser()

parser.add_argument('l', type=int, help='Длина чисел')
args = parser.parse_args()


class Numbers:
    start_time = time.time()
    print('Start process...')

    def __init__(self):
        self.execution()
        self.write()

    def execution(self):
        exec = list(map(''.join, itertools.product('0123456789', repeat=args.l)))
        self.exec = (sorted(exec, key=lambda exec: random.random()))
        print('\nКоличество комбинаций: ' + str(len(exec)))

    def write(self, file_name=str('num_dict' + str(args.l) + '.txt')):
        with open(file_name, 'w') as file:
            file.write('\n'.join(self.exec))
        print(f'\nCompleted in: {time.time() - self.start_time:.2f} sec.')


search = Numbers()
