"""
Вы раздобыли архив secure.zip и по имеющимся сведениям, пароль архива
o_main_got***** в котором последние 5 знаков это цифры.
Напишите программу, используя прогрессбар, которая подберёт пароль, и
вытащит содержимое архива. Недостающие цифры генерируйте в программе, а
не берите из файла.
"""
import zipfile
from tqdm import tqdm
import itertools as its
import string

zip_file = zipfile.ZipFile('secure.zip')
passwords = ['o_main_got' + i for i in list(map(''.join, its.product(string.digits, repeat=5)))]

print(f'Total passwords to test: {len(passwords)}\n')
for password in tqdm(passwords, total=len(passwords), unit=' password'):
    try:
        zip_file.extractall(pwd=password.encode().strip())
    except (RuntimeError, zipfile.BadZipfile):
        pass
    else:
        print('\nPassword found:' + '\033[32m', password.strip())
        exit(0)
print('Password not found', '\033[91m' + 'try another wordlist.')