"""
Создайте базу данных example с таблицей users и колонками id, login, passwd.
Напишите программу, которая принимает на вход логин с паролем и записывает
их в эту базу данных. Пароль должен быть в базе захеширован в формате SHA-1.
"""
import mysql.connector as sql
import hashlib

mydb = sql.connect(host='localhost', database='example', user='root', passwd='root')
mycr = mydb.cursor().execute("CREATE TABLE users (id INT AUTO_INCREMENT PRIMARY KEY, login VARCHAR(50), password VARCHAR(50)) IF NOT EXISTS;")

login, password = input('Введите логин: '), input('Введите пароль: ')
ins = 'INSERT INTO users (login, password) VALUES(%s, %s);'
val = (login, hashlib.sha1(password.encode()).hexdigest())
mycr.execute(ins, val)
mydb.commit()
mydb.close()
print(mycr.rowcount, 'The information has been added!')