"""
Напишите программу, которая принимает на вход логин и пароль от базы данных
example. Если логин и пароль совпали, выведите Password accepted!, а иначе
Access is denied!
"""
import mysql.connector as sql
import hashlib

mydb = sql.connect(host='localhost', user='root', password='root', db='example')
mycr = mydb.cursor()

while not mycr.execute("SELECT login FROM users WHERE login=" + input('Введите логин: ')):
    print('Access is denied!')
    mycr.execute("SELECT login FROM users WHERE login=" + input('Введите логин: '))
else:
    while not mycr.execute("SELECT passwd FROM users WHERE passwd=" + hashlib.sha1(input('Введите пароль: ').encode()).hexdigest()):
        print('Access is denied!')
        mycr.execute("SELECT passwd FROM users WHERE passwd=" + hashlib.sha1(input('Введите пароль: ').encode()).hexdigest())
    else:
        print('Password accepted!')
