"""
Напишите программу, используя threading, которая при запуске напечатает
Привет Бро! Я занял первое место в конкурсе! и через 5 секунд запустит просмотр
картинки nb.png
Использовать sleep и любые модули которых не было в курсе нельзя.
"""

import os
import threading as t

def task1():
    os.system('eog /home/tarasr/Desktop/PythonAdvanced/nb.png')

t = t.Timer(5, task1)
t.start()
print('Привет Бро! Я занял первое место в конкурсе!')