"""
Напишите программу, в которой будет запущено 2 потока, оба используют одну
глобальную переменную x = 500000. Первый поток добавляет по единице к x
500000 раз, а второй отнимает единицу 300000 раз. Каждый поток стартует 10 раз
подряд, чтобы убедиться что вычисления получаются корректными. Вывод
должен соответствовать картинке ниже, с теми же сообщениями выше/ниже.
"""

import threading as t

x = 500000
print('Start of the process...\n')


def plus():
    global x
    x += 1


def minus():
    global x
    x -= 1


def thread_task1():
    with lock:
        for _ in range(500000):
            plus()


def thread_task2():
    with lock:
        for _ in range(300000):
            minus()


def main_task():
    global x
    x = 500000
    t1 = t.Thread(target=thread_task1)
    t2 = t.Thread(target=thread_task2)
    t1.start()
    t2.start()
    t1.join()
    t2.join()


lock = t.Lock()
for i in range(1, 11):
    main_task()
    print('Iteration {0:>2}: x = {1}'.format(i, x))
print('\nDone!')
