"""
Напишите программу, где одновременно стартуют на короткую дистанцию
стритрейсеры на 3-х автомобилях – MAZDA, HONDA, TOYOTA.
Автомобиль MAZDA добирается до финиша первым за 15 секунд, HONDA за 18, и
TOYOTA за 19. Сделайте вывод как на картинке: Выведите количество активных
автомобилей, замерьте время участия в гонке, и раскрасьте с помощью модуля
colorama цветами GREEN и LIGHTMAGENTA_EX.
"""

import threading as t
import colorama as c
import time

start = time.time()


class Task3(t.Thread):
    def __init__(self, left, name, place, sec):
        super().__init__()
        print(f'Автомобиль {name} стартовал!')
        self.drive = t.Timer(sec, self.car)
        self.left, self.name, self.place, self.time = left, name, place, sec

    def car(self):
        print(f'\nКоличество активных авто {self.left}',
              f'\nАвтомобиль {c.Fore.GREEN + self.name + c.Fore.RESET} финишировал {self.place}',
              c.Fore.LIGHTMAGENTA_EX + f'\nДоехал до финиша за: {(time.time() - start):.3f} sec.')

    def run(self):
        self.drive.run()


tr1 = Task3(3, 'MAZDA', 1, 15)
tr2 = Task3(2, 'HONDA', 2, 18)
tr3 = Task3(1, 'TOYOTA', 3, 19)
tr1.start()
tr2.start()
tr3.start()