"""
Вы составили список дел на сегодня:
4 Оплатить счета ЖКУ
5 Полежать в ванной
1 Сходить в магазин
7 Посмотреть кино
3 Отремонтировать дверную ручку
2 Выбросить хлам с антресолей
6 Составить список дел на завтра
Выведите список дел согласно приоритетам.
"""

from queue import PriorityQueue

q = PriorityQueue()
q.put((4, 'Оплатить счета ЖКУ'))
q.put((5, 'Полежать в ванной'))
q.put((1, 'Сходить в магазин'))
q.put((7, 'Посмотреть кино'))
q.put((3, 'Отремонтировать дверную ручку'))
q.put((2, 'Выбросить хлам с антресолей'))
q.put((6, 'Составить список дел на завтра'))

while not q.empty():
    priority, action = q.get()
    print(f'{priority}\n{action}')