"""
Напишите программу, показывающую очерёдность сборки и разборки стопки
монет из 10 штук. Каждая монета ставится/снимается с интервалом в 1 секунду.
"""

import queue
import time

q_assemble, q_dis = queue.Queue(), queue.LifoQueue()

for i in range(1, 11):
    q_assemble.put(i)
    q_dis.put(i)
print('Собираем стопку монет...')
for i in range(q_assemble.qsize()):
    time.sleep(1)
    print(q_assemble.get(), end=' ')
print('\nРазбираем стопку монет...')
for i in range(q_dis.qsize()):
    time.sleep(1)
    print(q_dis.get(), end=' ')