"""
Пятеро курсантов одновременно снаряжают по одному патрону магазины
автомата Калашникова. В магазин помещается 30 патронов. Патроны берутся из
одной коробки, в которой их всего 150 штук.
Напишите программу используя модуль multiprocessing и сделайте вывод как на
скриншоте.
"""
from multiprocessing import Process, Queue


def printing(coursant, z):
    z.put(coursant)
    print(f'Курсант {coursant} начал снаряжать магазин...')
    for cnt in range(0,30):
        print(cnt+1, end=' ')
    print(f'\nКурсант {coursant} снарядил магазин!\n')


q = Queue()
quantity = 150

for coursant in range(1,6):
    if quantity >= 0:
        quantity -= 30
        Process(target=printing, args=(coursant, q)).start()
        q.get()
        print(quantity)