"""
Напишите многопоточный сканер портов, используя модуль multiprocessing и
класс Process. Сканер принимает на вход любой адрес сайта, например
codeby.net и сканирует диапазон портов 0-65535.
"""

import socket
from multiprocessing import Process, Queue


def port_scan(hostname, port_num, queue):
    queue.put(i)
    s = socket.socket(socket.AF_INET, socket.SOCK_STREAM)
    s.settimeout(1)
    try:
        s.connect((hostname, port_num))
        print(f'{hostname}, Port {port_num:<5} is open.')
    except socket.error:
        print(f'{hostname}, Port {port_num:<5} is not open.')
    finally:
        s.close()


ip = socket.gethostbyname(input('Введите Ваш сайт: '))
print('\nStart scan...')
q = Queue()
for i in range(2**16):
    Process(target=port_scan, args=(ip, i, q)).start()
    q.get()
