"""Напишите программу, которая из группы снимков, которые находятся в папке photo, найдёт фото сделанное в сентябре 2019 года и выведет метаданные в консоль.
Вручную названия файлов размещать в списках, или любых других итерируемых последовательностях нельзя! Учтите что файлов может быть не одна тысяча."""



import exifread
import os
from multiprocessing import Process, Queue


def task1(f):
    tags = exifread.process_file(f)
    if tags['Image DateTime'][:7] == '2019:09':
        print(f'The picture {file} was taken in September, 2019.')


q = Queue()
for file in os.listdir('/home/tarasr/Desktop/PythonAdvanced/photo'):
    with open(file, 'rb') as fl:
        Process(target=task1, args=(fl,)).start()
        q.get()