"""Напишите программу, которая извлечёт координаты GPS у фото duck.jpg, при необходимости конвертирует координаты в подходящий формат, и определит где сделан снимок (например используйте модуль geopy, установка pip install geopy)."""



from GPSPhoto import gpsphoto
from geopy import Nominatim
import os


def location_finder(f_name):
    data, geolocator = gpsphoto.getGPSData(f_name), Nominatim(user_agent='a2.py')
    location = geolocator.reverse(f"{data['Latitude']}, {data['Longitude']}")
    print(location)


while not os.path.isfile(file := input('Введите директорию: ')):
    print('Введите правильный путь к файлу!')
else:
    location_finder(file[file.rfind("/") + 1:])