"""
Напишите следующий код TCP клиента и сервера – при подключении клиент
передаёт серверу сообщение Мудрым пользуйся девизом - будь готов к любым
сюрпризам и сразу отключается, сервер также завершает работу.
"""
"""сервер"""
import socket

s = socket.socket()
print('Жду подключения...')
s.bind(('0.0.0.0', 4444))
s.listen(1)
conn, addr = s.accept()
try:
    print('Соединение установлено!', addr)
    while (client_mes := conn.recv(1024).decode()):
        print('Клиент: ', client_mes)
        break
    print('Соединение закрыто.')
except Exception as e:
    print('ERROR ', e)
finally:
    conn.close()

"""клиент"""
import socket

s = socket.socket()
try:
    s.connect(('127.0.0.1', 4444))
    print('Соединение установлено!')
    client_mes = 'Мудрым пользуйся девизом - будь готов к любым сюрпризам!'
    s.send(client_mes.encode())
except Exception as e:
    print('ERROR ', e)
finally:
    s.close()