"""
Напишите двусторонний чат UDP сервер-клиент, то есть обе стороны должны как
отправлять сообщения, так и принимать. Выход из чата при вводе на стороне
клиента exit. Перехватите все возможные исключения.
"""

"""сервер"""
import socket

host, port = 'localhost', 7777
addr = (host, port)
server = socket.socket(socket.AF_INET, socket.SOCK_DGRAM)
server.bind(addr)
print('Жду подключения...')
print('Соединение установлено!', server.recvfrom(1024)[1])

while True:
	try:
		d = server.recvfrom(1024)
	except Exception as e:
		print('ERROR ', e)
		break
	received, address = d[0].decode('utf-8'), d[1]
	#print('Соединение установлено!', address)
	if received == 'exit':
		print(f'Клиент UDP: {received}.', '\nСоединение закрыто.')
		break
	else:
		print ('Клиент UDP: ', received)
		msg = server.sendto(input('Сервер UDP: ').encode('utf-8'), address)
server.close()

"""клиент"""
import socket

host, port = 'localhost', 7777
client = socket.socket(socket.AF_INET, socket.SOCK_DGRAM)
print('Соединение установлено!')

while True:
    try:
        msg = input('Клиент UDP: ')
    except Exception as e:
        print('ERROR ', e)
    else:
        client.sendto(msg.encode('utf-8'), (host, port))
        if msg == 'exit':
            break
        d = client.recvfrom(1024)
        reply, addr = d[0], d[1]
        print('Сервер UDP: ' + reply.decode('utf-8'))
client.close()