"""
Напишите программу, скачивающую частями картинку
https://i.ytimg.com/vi/VKErEwtJ-Nw/maxresdefault.jpg, и загружающую её в корневую
директорию ftp-юзера с названием 'winner.jpg'. После завершения работы
выводится в консоль сообщение Файл скачан и загружен на FTP-сервер.
"""
import requests as r
from ftplib import FTP

url = 'https://i.ytimg.com/vi/VKErEwtJ-Nw/maxresdefault.jpg'
rsp = r.get(url)
rsp.raise_for_status()
filename = '~/winner.jpg'
with open(filename, 'wb') as file:
    file.write(rsp.content)

ftp = FTP('localhost')
ftp.login('ftp-user', '111')
flnm = '/winner.jpg'
with open (flnm, 'rb') as fl:
    ftp.storbinary('STOR winner.jpg', fl)
print('Файл скачан и загружен на FTP-сервер.')
ftp.quit()