#Создайте класс принимающий следующие параметры – title, name, surname.
#Параметры описывают название кинофильма, имя и фамилию одного из главных
#актёров. Создайте 5 экземпляров класса, в каждом из атрибутов название фильма
#должно состоять из одного-двух слов, и сами фильмы должны быть иностранного
#производства.
#Используя наследование, создайте второй класс, где будет тоже самое
#отечественного производства. Всего должно получиться 10 фильмов.
#Выведите всё из обоих классов в столбик, пример:
#Хищник - в главной роли Арнольд Шварценеггер
#Кавказская пленница - в главной роли Александр Демьяненко

class ForeignMovies:
    
    def __init__(self, title, name, surname):
        self.title = title
        self.name = name
        self.surname = surname
        print(f'{title} - в главной роли {name} {surname}.')


class RussianMovies(ForeignMovies):
    def __init__(self, title, name, surname):
        super().__init__(title, name, surname)


Predator = ForeignMovies('Predator', 'Arnold', 'Schwarzenegger')
Titanic = ForeignMovies('Titanic', 'Leonardo', 'Di Caprio')
TheUntouchables = ForeignMovies('The Untouchables', 'Kevin', 'Costner')
TheGodfather = ForeignMovies('The Godfather', 'Marlon', 'Brando')
StarWars = ForeignMovies('Star Wars', 'Dart', 'Wader')
KavkazskayaPlennitsa = RussianMovies('Кавказская пленница', 'Александр', 'Демьяненко')
BrilliantovayaRuka = RussianMovies('Бриллиантовая рука', 'Юрий', 'Никулин')
IroniyaSudbi = RussianMovies('Ирония судьбы', 'Андрей', 'Мягков')
Brat = RussianMovies('Брат', 'Сергей', 'Бодров')
Voyna = RussianMovies('Война', 'Алексей', 'Чадов')