#Напишите функцию, подсчитывающую количество знаков текста без учёта
#пробелов в предложении, которое подаётся на вход в программу. Добавьте и
#выведите строку документации: Программа считает количество символов без
#учёта пробелов c использованием метода класса.


class Task1:
    """Программа считает количество символов без учёта пробелов."""
    def task1 (self, str_inp):
        print(f'В предложении {len(str_inp.replace(" ", ""))} символов.\n')
        vowels, consonants = 0, 0
        for letter in str_inp:
            if letter.isalpha():
                if letter.lower() in 'ауоыияюёе':
                    vowels += 1
                else:
                    consonants += 1

        self.output(vowels, consonants)

    def output(self, vowels, consonants):
        print(f'В преложении {vowels} согласных букв и {consonants} гласных.')

result = Task1()
result.task1(str(input('Введите предложение: ')))