#Создайте 2 класса с конструктором, у первого есть 3 аргумента name, prepayment
#и summa. Во втором классе с помощью метода super добавьте ещё 2 – salary и
#summa2. Данные вставляйте произвольные, и выведите их из обоих классов,
#например так:
#Егор Конюхов – аванс 10500 рублей
#Мария Илюшина – аванс 15000 рублей, зарплата 35000 рублей

class Employees1:
    def __init__(self, name, prepayment, summa):
        self.prepayment = prepayment
        self.name = name
        self.summa = summa


class Employees2(Employees1):
    def __init__(self, name, prepayment, summa, salary, summa2):
        self.salary = salary
        self.prepayment = summa2
        super().__init__(name, prepayment, summa)


EgorKoniuhov = Employees1('Егор Конюхов', 10500, 30000)
MaryIliushina = Employees2('Мария Илюшина', 15000, 9000, 35000, 11000)
print(f'{EgorKoniuhov.name} - аванс {EgorKoniuhov.prepayment} рублей.')
print(f'{MaryIliushina.name} - аванс {MaryIliushina.prepayment} рублей, зарплата {MaryIliushina.salary} рублей.')