#Используя функции и аргументы напишите программу с помощью коструктора#:
#На вход в программу подаётся число от 250 до 10000. Число обозначает
#количество патронов.
#Скорострельность пулемёта 1200 выстрелов в минуту. В одной пулемётной ленте
#250 патронов. На смену ленты уходит 20 секунд.
#За сколько секунд пулемётчик расстреляет все патроны, если считать что первая
#лента уже установлена в пулемёт?
#Если число на входе не попадает в диапазон, вывести: Введите число от 250 до
#10000.


import math


class Task2():

    def __init__(self, int_inp):
        self.int_inp = int_inp
        res = str((int_inp / 1200) * 60 + ((math.ceil(int_inp / 250) - 1) * 20))

        self.output(int_inp, res)

    def output(self, int_inp, res):
        self.res = res
        if 250 > self.int_inp or self.int_inp > 10000:
            print('Введите число от 250 до 10000.')
        else:
            print(f'Патроны закончатся через {self.res}  секунд')


result = Task2 (int(input('Введите количество патронов: ')))