#Создайте 2 класса принимающие на вход по 2 аргумента используя полиморфизм.
#В одном классе вычисляется площадь эллипса через полуоси, а во втором объём
#конуса через высоту и радиус. Вывод результатов ограничить двумя знаками
#после плавающей точки. Сделайте перехват исключений, и при вводе
#некорректных данных выведите Введите корректные данные!

import math as m


class Ellipse:
    """\t\tплощадь эллипса через полуоси\n"""
    @staticmethod
    def count():
        try:
            axis1 = int(input('Введите первую ось: ')) > 0
            axis2 = int(input('Введите вторую ось: ')) > 0

            if axis1 <= 0 or axis2 <= 0:
                print('\nВведите корректные данные!')
        except:
            print('\nВведите корректные данные!')
        else:
            square = m.pi * axis1 * axis2
            print(f'\nПлощадь эллипса равняется {square:.2f}кв. единиц.')


class Cone:
    """\t\tобъём конуса через высоту и радиус\n"""
    @staticmethod
    def count():
        try:
            r = int(input('Введите радиус: '))
            h = int(input('Введите высоту: '))

            if r <= 0 or h <= 0:
                print('\nВведите корректные данные!')
        except:
            print('\nВведите корректные данные!')
        else:
            volume = (m.pi * r**2 * h) / 3
            print(f'\nПлощадь эллипса равняется {volume:.2f}кв. единиц.')


print(Ellipse.__doc__)
Ellipse.count()
print(Cone.__doc__)
Cone.count()