#Напишите программу с использованием ООП, высчитывающую площадь
#трапеции. На вход в программу подаются три параметра - атрибуты класса d1 и d2
#это диагонали трапеции, а h высота. Вывод результата ограничьте двумя
#символами после плавающей точки. Если с введёнными параметрами трапеция
#не может существовать, то вывести Введите корректные параметры трапеции.

class Trapezoids:
    
    def __init__(self, d1, d2, h):
        s = (((d2 ** 2 - h ** 2) ** 0.5 + (d1 ** 2 - h ** 2) ** 0.5) / 2) * h

        self.output(d1, d2, h, s)

    def output(self, d1, d2, h, s):
        if d1 <= 0 or d2 <= 0 or h <= 0:
            print('\nВведите корректные параметры трапеции!')
        else:
            print(f'\nПлощадь трапеции равняется {s:.2f}кв.м.')


result = Trapezoids(int(input('Введите диагональ 1: ')), int(input('Введите диагональ 2: ')), int(input('Введите высоту: ')))