"""Напишите программу, которая при запуске создаст БД first c таблицей product и
колонками id, name, price, и после завершения работы выведет сообщение:
The database 'first' was created!"""

import mysql.connector as sql

mydb = sql.connect(host='localhost', user='root', passwd='root')

mc = mydb.cursor()
mс.execute('create database first')
mc.execute('use first')

mycursor.execute("CREATE TABLE пикничок (id INT AUTO_INCREMENT PRIMARY KEY, name VARCHAR(50),\
                 price VARCHAR(50))")

print("The database 'first' has been created!")

ins = 'INSERT INTO пикничок (name, price) VALUES(%s, %s)'
val = [('коньячок', '1000 рублей'), ('шашлычок', '800 рублей'), ('водочка', '680 рублей'),
       ('селёдочка', '430 рублей'), ('петрушечка', '72 рубля')]
mс.executemany(ins, val)
mydb.commit()

mydb.close()
