"""Напишите программу, которая будет принимать через input неограниченное число
запросов к БД MySql. При запуске программы выводите следующее приглашение
для ввода команд Enter SQL >
При вводе exit завершить работу и вывести сообщение - Work with the database is
complete"""

import mysql.connector as sql

mydb = sql.connect(host='localhost', user='root', passwd='root')

try:
    mycursor = mydb.cursor()
    while (command:= input('Enter SQL > ')) != 'exit':
        mycursor.execute(command)
        for i in mycursor:
            print(i)
    else:
        print('Work with the database is complete.')

except Error as e:
    print(e)

mydb.close()