"""
Напишите программу кодирования/декодирования с помощью шифра Атбаш для
кириллицы.
"""


class Task1:
    def __init__(self):
        a, b = ord('а'), ord('А')
        self.alphabet = [chr(i) for i in range(b, b + 6)] + [chr(a + 33).upper()] + \
                        [chr(i) for i in range(b + 6, b + 32)] + [chr(i) for i in range(a, a + 6)] + \
                        [chr(a + 33)] + [chr(i) for i in range(a + 6, a + 32)]
        self.alpha = list(self.alphabet)
        self.alpha.reverse()
        print(f'1 --- закодировать\n2 --- декодировать\n3 --- выйти')
        while True:
            while (action := input('\nВыберите действие: ')) not in ['1', '2', '3']:
                print("\nЧилавеку свойсвина ашыбаца. Попробуй ещё!\n")
            else:
                if action == '1':
                    encode = self.execution(self.alphabet, self.alpha)
                    print('\nЗакодированное сообщение: ' + encode)
                elif action == '2':
                    decode = self.execution(self.alpha, self.alphabet)
                    print('\nДекодированное сообщение: ' + decode)
                else:
                    print('\nДо свидания!')
                    raise SystemExit

    def execution(self, source, target):
        text_dec, res = input('Введите текст: '), ''
        while set(text_dec).isdisjoint(set(self.alphabet)):
            print('\t\nИзвини, я понимаю только по-русски.')
            text_dec, res = input('Введите текст: '), ''
        else:
            for bukva in text_dec:
                for ind, char in enumerate(source):
                    if bukva == char:
                        res += target[ind]
        return res


if __name__ == '__main__':
    #print(f'1 --- закодировать\n2 --- декодировать\n3 --- выйти')
    run = Task1()