"""
Напишите программу, которая взломает шифр методом брутфорса, и выведет в
консоль расшифрованное слово =Lryqna Ljnbja=
Программа должна распознавать оба регистра английского алфавита, и любые
символы, которые не входят в алфавит.
"""
import string as st


def caesar_decode(key, message = '=Lryqna Ljnbja=', final = ''):
    for i in range(len(message)):
        if message[i].isupper():
            final += chr((ord(message[i]) - key - 65) % 26 + 65)
        elif message[i].islower():
            final += chr((ord(message[i]) - key - 97) % 26 + 97)
        else:
            final += message[i]
    return final


for key in range(len(st.ascii_lowercase)):
    print(f'Key +{str(key):<2}: {caesar_decode(key)}')