"""
Напишите программу, которая генерирует словарь, состоящий из цифр и букв
обоих регистров. Длину слова задаёт пользователь. Выведите количество
комбинаций сразу при запуске, до записи в файл. Сгенерированный словарь
запишите в файл my_dict.txt
При неверном вводе напечатайте сообщение.
"""

import itertools as its
import string

print('Keyword Generator\n')

while not (qnt := input('Количество символов: ')).isdigit() and int(qnt) < 10:
    print('Ошибка! Введите целое число больше 0.')
else:
    exec = list(map(''.join, its.product(string.ascii_letters + string.digits, repeat=int(qnt))))
    print(f'Количество комбинаций: {len(exec)}')
    with open('my_dict.txt', 'w') as file:
        file.write('\n'.join(exec))
    print('\nDone!')