"""
Напишите программу, в которой можно выбрать генерацию словаря, используя
следующие опции:
B - большие буквы
L - маленькие буквы
S – спецсимволы
N – числа
Пользователь может выбрать любое сочетание этих опций, или одну из них для
генерации словаря. Сгенерированный словарь запишите в файл gen_dict.txt.
Пользователь может вводить имя опции в любом регистре.
"""

import itertools as its
import string as st

print('Keyword Generator\n')
print('B - большие буквы\nL - маленькие буквы\nS – спецсимволы\nN – числа\n')

args_dict = {'B': st.ascii_uppercase, 'L': st.ascii_lowercase, 'S': st.punctuation, 'N': st.digits}
while set((args := input('Выберите аргументы: ')).upper()) & set(args_dict.keys()):
    while not (qnt := input('Количество символов: ')).isdigit() and int(qnt) < 10:
        print('Ошибка! Введите целое число больше 0.')
    else:
        chars = ''.join([args_dict[i] for i in list(set(args.upper()) & set(args_dict.keys()))])
        exec = list(map(''.join, its.product(chars, repeat=int(qnt))))
        print(f'Количество комбинаций: {len(exec)}')
        with open('gen_dict.txt', 'w') as file:
            file.write('\n'.join(exec))
        print('\nDone!')
else:
    print('Ошибка! Введите аргументы.')
